tools/load-tests/artillery/scenarios/load-500.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 180
      arrivalRate: 1
      maxVusers: 1
      name: 'Load test - 500 notes (balanced distribution)'
  processor: '../helpers/session-processor.js'
  variables:
    apiKey: '{{ $env.API_KEY }}'
    notesCount: 500
    assetsCount: 100
  env:
    NOTE_SIZE_PROFILE: 'balanced'
  plugins:
    expect: {}

scenarios:
  - name: 'Heavy Load Test - 500 Notes'
    flow:
      - function: 'generateSessionPayloads'

      - post:
          url: '/api/session/start'
          headers:
            x-api-key: '{{ apiKey }}'
            Content-Type: 'application/json'
          json:
            notesPlanned: 500
            assetsPlanned: 100
            batchConfig:
              maxBytesPerRequest: 10485760
            ignoredTags: []
          capture:
            - json: '$.sessionId'
              as: 'sessionId'
          expect:
            - statusCode: 201

      - post:
          url: '/api/session/{{ sessionId }}/notes/upload'
          headers:
            x-api-key: '{{ apiKey }}'
            Content-Type: 'application/json'
          json:
            notes: '{{ notes }}'
            cleanupRules: '{{ cleanupRules }}'
          expect:
            - statusCode: 200

      - post:
          url: '/api/session/{{ sessionId }}/assets/upload'
          headers:
            x-api-key: '{{ apiKey }}'
            Content-Type: 'application/json'
          json:
            assets: '{{ assets }}'
          expect:
            - statusCode: 200

      - post:
          url: '/api/session/{{ sessionId }}/finish'
          headers:
            x-api-key: '{{ apiKey }}'
            Content-Type: 'application/json'
          json:
            notesProcessed: 500
            assetsProcessed: 100
          expect:
            - statusCode: 200