tools/load-tests/artillery/scenarios/quick.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 30
      arrivalRate: 1
      maxVusers: 1
      name: 'Quick smoke test - 10 notes'
  processor: '../helpers/session-processor.js'
  variables:
    apiKey: '{{ $env.API_KEY }}'
    notesCount: 10
    assetsCount: 5
  plugins:
    expect: {}

scenarios:
  - name: 'Quick Smoke Test'
    flow:
      - function: 'generateSessionPayloads'

      - post:
          url: '/api/session/start'
          headers:
            x-api-key: '{{ apiKey }}'
            Content-Type: 'application/json'
          json:
            notesPlanned: 10
            assetsPlanned: 5
            batchConfig:
              maxBytesPerRequest: 10485760
            ignoredTags: []
          capture:
            - json: '$.sessionId'
              as: 'sessionId'
          expect:
            - statusCode: 201

      - post:
          url: '/api/session/{{ sessionId }}/notes/upload'
          headers:
            x-api-key: '{{ apiKey }}'
            Content-Type: 'application/json'
          json:
            notes: '{{ notes }}'
            cleanupRules: '{{ cleanupRules }}'
          expect:
            - statusCode: 200

      - post:
          url: '/api/session/{{ sessionId }}/assets/upload'
          headers:
            x-api-key: '{{ apiKey }}'
            Content-Type: 'application/json'
          json:
            assets: '{{ assets }}'
          expect:
            - statusCode: 200

      - post:
          url: '/api/session/{{ sessionId }}/finish'
          headers:
            x-api-key: '{{ apiKey }}'
            Content-Type: 'application/json'
          json:
            notesProcessed: 10
            assetsProcessed: 5
          expect:
            - statusCode: 200